In [1]:
%matplotlib inline

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

<p style = "font-size: 13px; color: mediumvioletred; text-align: right" > Autumn 2024

<p style = "font-size: 22px; color: mediumvioletred; text-align: center" > being feminine in a fast-paced world

<p style = "font-size: 16px; color: mediumvioletred; text-align: center" > by Irina Nedyalkova

Is there place for femininity in the tech world or is it a 15 minutes thing? We do feminine melting, reshaping individuality from a wide format to a long format. Pardon, short format. One is for sure, I can not express myself in 15, 10 or 5 minutes. It has been required to fold my entire cosmos in a tiny origami. Did not go well. To do things fast is a men quality, they are great at this! Women need a liiittle more time to unroll. We have perfection, when both personalities fuse, and a mess, when we try to adapt something that is not adaptable.

> In Ralph Waldo Emerson words: "Adopt the pace of nature. Her secret is patience."

No time for patience here! We must develop Artificial Intelligence! After 2 job interviews at tech companies, I just start feeling like a robot. "There are 1000 people working for us in the Bulgarian office." Oh! Eventually, I would be the 1001. Double Oh! "There are not executives on place, just one." Trioh!

> “The factory of the future will have only two employees, a man and a dog. The man will be there to feed the dog. The dog will be there to keep the man off from touching the machines.” Warren G. Bennis

This Bulgarian office reminds me of 1000 thousand machines and a dog. I am more a start-up fan, believing in people and ideas, where the romantic in business still exists and the target is happiness.

Warren G. Bennis is one of the world's leading experts on leadership, consultant and writer. Professor Bennis has been an advisor to four U.S. presidents, including John F. Kennedy and Ronald Reagan. Artificial Intelligence has been around in various forms since the English mathematician Alan Turing gave a lecture on the subject in 1947 and Warren Bennis predicted the XXI century in 1991. So, why that hurry?

> "Too many companies believe people are interchangeable. Truly gifted people never are. They have unique talents. Such people cannot be forced into roles they are not suited for, nor should they be. Effective leaders allow great people to do the work they were born to do." Organizing Genius: The Secrets of Creative Collaboration, Warren G. Bennis

I still want to find my place in the tech world. I am curious about! Personally, do not own many technologies, just the essentials, but my whole life I am listening to techno music, finding my peace in the deepest bass sound. So, where do I find peace in the tech world?

Due to the World Health Organization, infertility is a disease of the male or female reproductive system, defined by the failure to achieve a pregnancy after 12 months or more of regular unprotected sexual intercourse, 1 in 6 people is globally affected. Confusion occurs in the laws of nature when placing women in a dude-like environment (if they do not belong there) and men, following a forewoman's orders (if they do not belong there). We are speaking from lifeforce energy and vitality. Our bodies never lie! If we have some itchy emotions, we are at the wrong place.

The data, I will present, belongs to the National Center for Health Statistics of the United States Government:

In [3]:
tables = pd.read_html(r"https://www.cdc.gov/nchs/nsfg/key_statistics/i-keystat.htm#infertility")

There are 11 tables, I will choose some of them.

In [4]:
tables[0]

                                  Unnamed: 0_level_0  \
                                  Unnamed: 0_level_1
0  Percentage and number of women 15-49 years of ...

                  2015-2019
       Percent (SE), Number Percent (SE), Number.1
0  13.4 (0.41), 9.7 million                    NaN

In [5]:
tables[1]

  Unnamed: 0_level_0    2015-2019
  Unnamed: 0_level_1     0 births 1 or more births
  Unnamed: 0_level_2 Percent (SE)     Percent (SE)
0  Total 15-49 years  13.8 (0.72)      13.1 (0.57)
1        15-29 years   9.2 (0.74)      12.0 (1.16)
2        30-39 years  22.2 (2.35)      12.2 (0.84)
3        40-49 years  33.4 (3.48)      14.5 (1.17)

In [6]:
tables[2]

                                  Unnamed: 0_level_0  \
                                  Unnamed: 0_level_1
0  Percentage and number of currently married wom...

                  2015-2019
       Percent (SE), Number Percent (SE), Number.1
0  16.3 (0.73), 4.7 million                    NaN

In [7]:
tables[3]

  Unnamed: 0_level_0    2015-2019
  Unnamed: 0_level_1     0 births 1 or more births
  Unnamed: 0_level_2 Percent (SE)     Percent (SE)
0  Total 15-49 years  26.0 (2.03)      14.1 (0.90)
1        15-29 years  14.6 (2.74)      11.8 (1.77)
2        30-39 years  27.3 (4.03)      13.2 (1.28)
3        40-49 years  43.3 (5.08)      15.6 (1.68)

In [8]:
tables[4]

                                  Unnamed: 0_level_0                2015-2019  \
                                  Unnamed: 0_level_1     Percent (SE), Number
0  Percentage and number of currently married wom...  8.5 (0.65), 2.4 million


  Percent (SE), Number.1
0                    NaN

In [9]:
tables[5]

  Unnamed: 0_level_0    2015-2019
  Unnamed: 0_level_1     0 births 1 or more births
  Unnamed: 0_level_2 Percent (SE)     Percent (SE)
0  Total 15-49 years  19.4 (1.92)       6.0 (0.64)
1        15-29 years  12.6 (3.01)       5.1 (1.16)
2        30-39 years  22.1 (3.33)       5.7 (0.88)
3        40-49 years  26.8 (4.50)       6.5 (1.13)

In [10]:
tables[6]

                                  Unnamed: 0_level_0    2015-2019
                                  Unnamed: 0_level_1 Percent (SE)
0  Percentage of women 15-49 years of age who hav...  12.2 (0.59)

In [11]:
tables[7]

                        Unnamed: 0_level_0    2015-2019
                        Unnamed: 0_level_1 Percent (SE)
0             Medical help to get pregnant   8.9 (0.49)
1                                   Advice   6.7 (0.40)
2                    Tests on woman or man   5.6 (0.40)
3                          Ovulation drugs   4.0 (0.26)
4    Surgery to treatment on blocked tubes   0.7 (0.12)
5                  Artificial insemination   1.7 (0.17)
6         Assisted Reproductive Technology   0.5 (0.10)
7  Any medical help to prevent miscarriage   5.2 (0.41)

In [12]:
tables[8]

  Unnamed: 0_level_0    2015-2019
  Unnamed: 0_level_1     0 births 1 or more births
  Unnamed: 0_level_2 Percent (SE)     Percent (SE)
0  Total 15-49 years   6.4 (0.53)      16.6 (0.87)
1        15-29 years   2.7 (0.40)      11.5 (1.49)
2        30-39 years  13.6 (1.89)      15.5 (1.13)
3        40-49 years  21.8 (2.89)      20.0 (1.54)

In [13]:
tables[9]

                                  Unnamed: 0_level_0    2015-2017    2017-2019
                                  Unnamed: 0_level_1 Percent (SE) Percent (SE)
0  Intended (i.e., pregnancy that the woman wante...  63.3 (1.16)  62.0 (1.04)
1  Mistimed (i.e., pregnancy that the woman wante...  22.9 (0.68)  22.4 (0.74)
2              Mistimed – Less than 2 years too soon   6.8 (0.48)   7.1 (0.41)
3                Mistimed – 2 years or more too soon  15.7 (0.70)  15.2 (0.72)
4  Unwanted (i.e., pregnancy that the woman did n...  13.8 (0.85)  15.7 (0.89)

In [14]:
tables[10]

                                  Unnamed: 0_level_0    2015-2017    2017-2019
                                  Unnamed: 0_level_1 Percent (SE) Percent (SE)
0  Intended (i.e., pregnancy that the man wanted ...  70.3 (2.32)  68.8 (1.16)
1  Mistimed (i.e., pregnancy that the man wanted ...  18.4 (1.89)  19.0 (0.88)
2  Unwanted (i.e., pregnancy that the man did not...  11.3 (1.60)  12.2 (0.94)

<p style="text-align: left; color: gray"> ...data need to be structured, more follows soon

References:
1. Data: https://www.cdc.gov/nchs/nsfg/key_statistics/i-keystat.htm#infertility